var data = [
    {
        "code": "序号",
        "name": "名字",
		"img": "图片地址",
        "info1": "地理分布",
        "info2": "形态特征",
        "info3": "栖所生态",
        "info4": "门",
        "info5": "纲",
        "info6": "目"
    },
    {
        "img": "https://adl.seafishery.com/0.jpg",
		"code": "Fish0",
        "name": "鲾科",
        "info1": "主要分布于印度-西太平洋海域，其中一种分布于地中海沿岸。台湾各地沿岸及离岛沙泥底海域或河口区均有分布。 ",
        "info2": "体呈卵圆形或长椭圆形，甚侧扁；口小，能伸缩自如，伸出时形成一向上、向下或向前之口管。上下颌齿细小，呈绒毛状，前端或有犬齿，或无；锄骨及腭骨无齿。喉部具有细菌共生的发光器官。眶上骨缘光滑或具锯齿；前鳃盖骨下缘具锯齿。鳃被架5，鳃盖膜与峡部相连。体被圆鳍，头部则裸露无鳞；背鳍与臀鳍基底具鳞鞘，腹鳍基部具腋鳞；侧线完全。背鳍单一，硬棘不游离，有锁固机制；臀鳍基底长，具III硬棘及13-14软条；胸鳍发达，似镰刀状；腹鳍胸位；尾柄细长，尾鳍叉形。全世界计9属25种（Nelson, 2006；Catalog of life, 2012）。",
        "info3": "本科鱼类属群游性，主要栖息于岸边之沙泥地、河口或内湾，通常不接近珊瑚礁区，有些种类会进入淡水河内，有些白天为底栖性而夜间则浮到表层活动。肉食性，以底栖动物为主食，而利用伸缩之口部将饵物吸入。 ",
        "info4": "脊索动物门",
        "info5": "辐鳍鱼纲",
        "info6": "鲈形目"
    },
    {
        "img": "https://adl.seafishery.com/1.jpg",
		"code": "Fish1",
        "name": "单角鲀科",
        "info1": "分布于遍布于世界暖海区。",
        "info2": "本单角魨体侧扁，口小。具2背鳍棘，第一棘大且可竖起，第二棘小，可后面嵌入第一棘而使之直立。鳞小且具小棘，使皮肤具丝绒感或沙纸感，而有「锉鱼」之称。一些种的雄鱼尾部的鳞棘较大，或两性鳞棘均大而雄鱼尤其明显。小口内有少数坚强的门齿样的牙齿，用以咬下珊瑚为食，并用以在软体动物的壳上钻孔以取食其柔软的部分。拟态革鲀(Aluterus scriptus)世界性分布，可长达100公分(40吋)，但单角魨类多体型较小。本科鱼类肉味不佳。",
        "info3": "本科鱼种体色具有随环境而变化的保护色能力，有些种类皮肤上会长出小皮瓣以伪装欺敌，亦有具与尖鼻魨相似体色的鱼种以模拟欺敌。平常喜欢躲藏于海藻丛、海鞭林或珊瑚丛间，利用特殊的体色变化，易使人忽略了他们的存在。属杂食性鱼类，觅食种类繁多，以底栖性动物及藻类为主。有些种类具有食用性价值，如薄叶单棘魨(Aluterus monoceros)，俗称剥皮鱼或白达仔，是台湾的重要渔产之一，尤其台湾北部十月至次年一月之主要捕获对象。有些则体色特殊，是水族业的宠物，其中以长吻单棘魨 (Oxymonacanthus longirostris）为代表。 ",
        "info4": "脊索动物门",
        "info5": "辐鳍鱼纲",
        "info6": "鲀形目"
    },
    {
        "img": "https://adl.seafishery.com/2.jpg",
		"code": "Fish2",
        "name": "笛鲷科",
        "info1": "广泛分布于世界三大洋之热带及亚热带海域，少数可生活于淡水及汽水域。",
        "info2": "体延长而呈纺锤形或长椭圆形，略侧扁。口中大或大，端位，前颌骨稍能伸缩；颌齿尖细，外行齿或前端齿有时扩大成犬齿状；锄骨和腭骨通常具细锥齿。主鳃盖骨一般无棘；前鳃盖骨缘具锯齿或光滑。体被小型或中型之栉鳞或圆鳞；颊部及鳃盖骨亦被鳞，上颌骨被鳞或无；侧线单一且完整。背鳍连续，硬棘部及软条部间具一缺刻；背鳍及臀鳍等之基部具鳞鞘；胸鳍尖长；腹鳍胸位；尾鳍截平、凹入或深叉形。全世界分4亚科，之前列入本科之乌尾鮗亚科（Caesioninae），已将其独立成一科，所以四亚科分别为滨鲷亚科（Etrlinae）、笛鲷亚科（Lutjaniane）、曳丝笛鲷亚科（Paradicichthyinae）及拟乌尾亚科（Apsilinae），共计17属约105种（Nelson, 2006）。",
        "info3": "本科种类繁多，一般为沿岸中上层或近海底层鱼类。独居或小群巡游，亦有多种种类聚集成一大群者，有些鱼种具有底栖穴居之习性。食性依种类而不同，有滤食浮游生物者（乌尾冬及拟乌尾冬类）或以小型甲壳类、小鱼等为食者（笛鲷及滨鲷类）。一般为夜行性鱼类，昼间大都群聚于独立礁石四周之礁和砂泥交界处活动，夜间则分散出外到砂地上觅食。幼鱼多半在较浅之珊瑚礁区成长。有些鱼种之体色在日夜间会有所变化。有些鱼种之成、幼鱼体色会不同。有些笛鲷在其他热带或副热带地区曾记录具有鱼毒，且致人 于死；但台湾则未闻曾发生过中毒事件。 ",
        "info4": "脊索动物门",
        "info5": "辐鳍鱼纲",
        "info6": "鲈形目"
    },
    {
        "img": "https://adl.seafishery.com/3.jpg",
		"code": "Fish3",
        "name": "鲷科",
        "info1": "广泛分布于世界各海域之温带及热带海域。",
        "info2": "体卵圆或椭圆形，侧扁而高，背缘轮廓凸。头大。口小或中大，端位，稍能伸缩。颌齿发达，圆锥状或门齿状，有些种类具臼齿；锄骨和腭骨无齿。主上颌骨大都或部分被眶前骨所覆盖，末端延伸至眼中部下方。前鳃盖骨缘平滑；体被栉鳞，颊部及主鳃盖骨亦被鳞；侧线完整。单一背鳍，X—XIII棘及8—15软条；臀鳍III棘及8—14软条；背鳍及臀鳍的最未端软条均分二叉；胸鳍尖长；腹鳍具腋鳞；尾鳍呈叉形，或稍内凹形。全世界计33属约115种（Nelson, 2006）。",
        "info3": "栖地变化大，砂泥底或岩礁底水域皆有，从河口、内湾、礁岸至大陆 棚较深之处均可发现，珊瑚礁区则存有少数鱼种。常聚集成群。杂食性，主要以底栖甲壳类、软体动物、棘皮动物或海藻为食，偶而捕食小鱼。雌 雄同体，且会性转变，先雌后雄型与先雄后雌型两种型式均有。通常在河口域产卵。 ",
        "info4": "脊索动物门",
        "info5": "辐鳍鱼纲",
        "info6": "鲈形目"
    },
    {
        "img": "https://adl.seafishery.com/4.jpg",
		"code": "Fish4",
        "name": "鲱科",
        "info1": "广泛分布于世界各海域以及热带、亚热带地区的河川或湖泊。",
        "info2": "体长椭圆形或长形，侧扁如刀，或略侧扁，腹部锐利或钝圆；沿着腹部常具有一列棱鳞。头侧偏，吻不突出。口小，端位；不具牙齿，若有也细弱；体被易脱落之小圆鳞；无侧线，或仅存在于体前部第二至第五鳞片上。背鳍单一，小型，位体中央或后部；臀鳍基底一般较长且位于体后方；胸鳍低位；腹鳍位背鳍下方，小型；尾鳍深叉；各鳍均无硬棘。全世界分6亚科，分别为圆腹鲱亚科（Dussumieriinae）、透体细鲱亚科（Sundasalangidae ）、淡水鲱亚科（Pellonulinae）、鲥亚科（Alosinae）、鲱亚科（Clupeinae）及鲚亚科（Dorosomatinae），共约57属188种，其中约57种为纯淡水种，甚少生活于汽水域，其余为纯海水种，少数种类可进入河口域（Nelson, 2006）。 ",
        "info3": "大部份栖息于近沿海浅水域，一部份为淡水种。最大体长可达60公分（为云鲥 Tenualosa ilisha 的纪录），一般皆不及25公分。栖息环境广泛，诸如淡水域、咸淡水之河口区、沿岸内湾及海洋性珊瑚礁区均可生活。除暖水域外，温水及泠水域亦有分布。群游性，大都成千上百的出现于水域之中表层，有些种类成群后的数量更是惊人，常常可达数亿尾，在海上绵延数浬，颇为壮观。多数鱼种可一次产下数以万计的漂浮性鱼卵，稚鱼亦行浮游生活。大部份种类以浮游动物之甲壳类为主食，属于滤食性；少数较大型鱼种则为肉食性。为了摄食，许多种类会做日夜的垂直回游，白天随着牠的饵料生物浮上水面，晚上则沉降到较深的水层；除了上下垂直回游外，不少种类会进行数百或数千浬的长距离摄食或产卵回游。本科鱼类为大型掠食鱼类、鲸豚及海鸟等掠食之对象，在食物链上具有相当重要的地位，且因其数量多，大多种类又为经济性食用鱼类，产量占了全球渔获的一半，是许多沿海国家重要的渔业资源。其所产仔鱼被称为「魩仔鱼」，是台湾重要的捕捞鱼种之一，但由于捕捞魩仔鱼时，常常也同时混获上百种其它经济性鱼类的仔稚鱼，例如鰺、笛鲷、正鲷、石斑、鲻、金梭、狗母，及其它珊瑚礁鱼类，对鱼类资源有一定的伤害，因此政府已明订每年6-8月为禁渔期，期盼将来的渔业资源能永续利用。 ",
        "info4": "脊索动物门",
        "info5": "辐鳍鱼纲",
        "info6": "鲱形目"
    },
    {
        "img": "https://adl.seafishery.com/5.jpg",
		"code": "Fish5",
        "name": "狗母鱼科 ",
        "info1": "大部份分布于印度-太平洋海域，少数则为全球分布。",
        "info2": "体延长，前部呈亚圆筒形，后部侧扁。吻前端稍尖，似三角形。口大而极宽，上颌末端延伸至眼后方，上颌之全部边缘均由纤长之前主上颌骨所构成；主上颌骨退化。齿发达，在上下颌、颚骨及舌面多呈刷毛状，亦具有一些较大之犬齿，通常能被倒伏。体被圆鳞或部份被鳞；具侧线。背鳍位体中部，具 9-14软条，后方具脂鳍；臀鳍为 8-16软条；腹鳍有8或9软条，位背鳍起点之略前方；胸鳍小，高位；尾鳍深叉；各鳍皆无硬棘。全世界计有2亚科，分别为合齿鱼亚科(Synodontinae）约2属37种、镰齿鱼亚科（Harpadontinae）约2属20种（Nelson, 2006）。",
        "info3": "为砂地上的主要底栖肉食性鱼种，但有时亦会在礁砂混合区生活；栖息深度由沿岸浅海域至深达4500公尺的深水域。某些鱼种之体表花纹在砂地上是很好的伪装，常在砂地上停滞不动或将身体埋入砂中，仅露出眼睛，伺机捕食水层中之小鱼或甲壳类。有报导指出，在日本海域所观察到的红斑狗母鱼(Synodus ulae)生殖行为，显示雄、雌鱼个体的体型相似(全长约20公分)，产卵发生在黄昏时分，雌、雄个体会一起冲到水层中，在最高点时，各自释出配子受精。 ",
        "info4": "脊索动物门",
        "info5": "辐鳍鱼纲",
        "info6": "仙女鱼目"
    },
    {
        "img": "https://adl.seafishery.com/6.jpg",
		"code": "Fish6",
        "name": "海鳝科",
        "info1": "广泛分布于全世界之温、热带海域，少数几种可进入淡水域生活。",
        "info2": "体呈圆柱状，尾部侧扁。头长。身被厚皮，且分泌有黏液，皮肤上的色素细胞多且密集。体表无鳞。口大；齿十分锐利，排列形式独特；无舌。后鼻孔为圆孔状、管状或短管状。鳃裂孔状；第四对鳃弓变粗特化，与位于食道上、下方的咽头齿板相连，形成一辅助咽食的骨质构造。无胸鳍及腹鳍；背鳍基底起始于鳃孔前方；背鳍、臀鳍与尾鳍相连。体色及斑点变化大，有单色、细点、圆点、不规则花纹及条纹等，是本科鱼类分类时的重要依据。目前全世界鯙科共有二个亚科：鯙亚科(Muraeninae)和鳍尾鯙亚科(Uropterygiinae)，约16属185种以上。其中鯙亚科是鯙科中最常见且最主要的一个亚科，其背鳍、尾鳍及臀鳍彼此相连且明显，包含蝮鯙属 (Echidna)、勾吻鯙属 (Enchelycore)、鼻瓣鯙属 (Enchelynassa)、裸鯙属 (Gymnomuraena)、裸胸鯙属 (Gymnothorax)、单鳃斑鯙属 (Monopenchelys)、鯙属 (Muraena)、拟蝮鯙属 (Pseudechidna)、管鼻鯙属 (Rhinomuraena)、星斑鯙属 (Siderea) 及长鯙属 (Strophidon) 等11 属。鳍尾鯙亚科则各止于尾部末端，且相连多不明显，包括裸臀鯙属 (Anarchias)、裂口鯙属 (Channomuraena)、胡鯙属 (Cirrimaxilla)、长圆鯙属 (Scuticaria) 和鳍尾鯙属 (Uropterygius)等5属(Nelson, 1994；Chen et Shao, 1995；Nelson, 2006)。",
        "info3": "属夜行性鱼类，大部分种类白天躲在珊瑚礁穴或岩块下，仅头部露出洞口，尾部卷缩在洞内，张口呼吸时即显露出其锐利之牙齿，少部分种类如管鼻鯙则生活在沙地海域。它们属于捕食者，多半夜间出外掠食其他鱼类，利用其如刀片般有时又内弯的牙齿，配合本身体躯似蛇般有力的扭曲力，猎物一旦被咬着则难以脱身；有的种类则以底栖动物或甲壳类等为食。由于皮肤厚且有黏液保护，使得它们能在珊瑚礁缝及岩缝中穿梭而不受伤。有些鯙类具有性别两色之现象，且伴随有性转变发生；有的种类先雌后雄 (protogynus)，有的先雄后雌(protandry)。例如黑身管鼻鯙（Rhinomuraena quaesita）之幼鱼为黑色，随成长而变为艷蓝色且带有黄色鳍的雄鱼，待完全变为黄色时，则已性转变为雌鱼。 ",
        "info4": "脊索动物门",
        "info5": "辐鳍鱼纲",
        "info6": "鳗鲡目"
    },
    {
        "img": "https://adl.seafishery.com/7.jpg",
		"code": "Fish7",
        "name": "蝴蝶鱼科",
        "info1": "广泛分布于世界各温带到热带的海域，但绝大多数生活于印度-西太平洋，尤其是珊瑚礁区海域。",
        "info2": "体呈菱形或近于椭圆形，且十分侧扁。口小，端位，略可伸缩；颌齿细长，在上下颌形成刷毛状之狭长齿带。前鳃盖骨平滑，但幼鱼可能具有锯齿或被有突棘。体被中或小型之弱栉鳞或圆鳞。侧线完整，呈弧形，但不明显。幼鱼之头部，因长有骨质板，而被称之Tholichthys。背鳍连续，硬棘部和软条部间有浅缺刻；腹鳍胸位，具腋鳞；尾鳍一般截形或圆形。全世界计11属约122种（Nelson, 2006）。 ",
        "info3": "蝴蝶鱼的幼鱼头部因被有骨质板，而被称之棘盾幼生，随着成长而消失；成鱼前鳃盖骨为平滑状，但有些种类的幼鱼是具有锯齿或被有突棘，长大后即消失了。大部份蝴蝶鱼属于日行性鱼类，觅食时，或群游，或成对，或独 游者。食性变异大，有的从礁岩表面啄食躲藏在缝隙里的小型无脊椎动物及藻类，有的在水层中捡食浮游动物，有的只吃活珊瑚的水螅虫等。体色亦会随成长而有所变化，而其中之共同点为：小鱼在背鳍或身体后方通常长有一伪装用的眼斑，随着成长而消失，其目的是用来蒙骗掠食者，使其误把尾部当做头部攻击，而争取逃走的机会；其次为大部份蝴蝶鱼具一条黑色纵带贯通眼睛，这也是欺敌的一种视觉效果。蝴蝶鱼因具有悦人的体色及优雅的泳姿，是热门的水族养殖宠物之一，但碍于它们生活史中需要经过一段长时间的漂流期，而使得人工繁殖不易成功。更由于滥捕之结果，海中之现存量已大不如前，是亟待保育的一群。 ",
        "info4": "脊索动物门",
        "info5": "辐鳍鱼纲",
        "info6": "鲈形目"
    },
    {
        "img": "https://adl.seafishery.com/8.jpg",
		"code": "Fish8",
        "name": "蓝子鱼科",
        "info1": "分布于印度-太平洋热带及亚热带海域及地中海东部。",
        "info2": "以藻类为食，一般渔民在清理鱼肚时常常会闻到海藻发酵的味道，甚是难闻，因而有『臭肚仔』之称。以前取其谐音而命名为『臭都鱼科』，现正名为『臭肚鱼科』。体呈长卵圆形，极侧扁。头小。吻略尖突，或突出而呈管状。口小，不能伸缩；颌齿一列，门状齿，排列紧密；锄骨、腭骨及舌上均无齿。体被极小之圆鳞，不易脱落；鳃盖骨及颊部亦被鳞；侧线单一且完全，高位。背鳍单一，硬棘部与软条部间具缺刻或不明显；胸鳍圆形；尾鳍内凹或叉形。全世界计1属22种（Nelson, 2006）。 ",
        "info3": "暖水性近岸小型至中大型鱼类。幼鱼大都成群栖息于枝状珊瑚丛中，以死珊瑚枝上的藻类为食，有的则待在混浊的红树林区或河口区成长。成鱼则成群洄游于珊瑚礁区，有的则生活于混浊的河口或港口区。日行性鱼类，以藻类为食。在大部分地区属游钓性之高经济食用鱼类，但需小心的是本科鱼类背鳍、腹鳍及臀鳍之硬棘具有毒腺，被刺后会引起剧痛。 ",
        "info4": "脊索动物门",
        "info5": "辐鳍鱼纲",
        "info6": "鲈形目"
    },
    {
        "img": "https://adl.seafishery.com/9.jpg",
		"code": "Fish9",
        "name": "鳞魨科",
        "info1": "广泛分布于世界三大洋。",
        "info2": "体高且侧扁，呈卵圆形或长椭圆形。眼位头部偏上后方。吻部尖且长。口小，端位；上下颌不可伸缩，上颌每侧各具七枚齿，外侧四枚齿，内侧三枚，下颌每侧皆四齿。鳃裂狭短且位于胸鳍基之前上方。皮肤粗糙，其上覆有不重叠之盾状鳞，而大部分鱼种在鳃裂后方另具变大之骨质鳞，有些在体后方具二列倒棘。背鳍具III硬棘，第一棘长而强，第二棘短，直立时可扣住第一棘，第三棘极小；第二背鳍与臀鳍相对；背鳍与臀鳍之软条分叉；腹鳍无硬棘，耻骨末端具退化之腹鳍鳍条，但被四对耻骨特化鳞（incasing scale)围住；尾鳍圆形或弯月形。全世界约11属40种（Nelson, 1994），。",
        "info3": "热带沿岸之日行性鱼类。通常单独活动，昼间在离珊瑚礁上方约1-2公尺高处之水域活动，仅靠第二背鳍及臀鳍来游动，故泳速慢，而其尾鳍之摆动则可加速前进。受惊时会躲入具有小入口的礁洞中，并以第一背鳍及腹鳍腰带撑直而卡在里面，以增加掠食者捕食他们的困难；夜间睡觉亦如同此法。大部分板机魨为食性复杂之肉食性，强而有力的双颌及锐利的牙齿使他们可轻易的咬碎带壳之生物，一般以底栖动物如甲壳类、软体动物、海胆等棘皮动物、海鞘、珊瑚虫及鱼类等为食，但有些则以浮游动物或底藻为食。产沈性卵，雌鱼会护卵而攻击任何接近的生物。皮剥魨由于变粗之第一背鳍硬棘之锁定直立与否，是由较小之第二硬棘放入或不放入其后缘之 V 字形深沟内来控制，其作用如『板机』，故俗名『板机魨』(Triggerfishes)。有些以其特殊之体色及可爱之模样而为水族养殖之宠物，如俗称小丑砲弹之花斑拟鳞魨(Balistoides conspicillum)。 ",
        "info4": "脊索动物门",
        "info5": "辐鳍鱼纲",
        "info6": "鲀形目"
    },
    {
        "img": "https://adl.seafishery.com/10.jpg",
		"code": "Fish10",
        "name": "隆头鱼科",
        "info1": "广泛分布于世界三大洋热带及亚热带海域",
        "info2": "本科种类众多，体形或体长变异均大，体延长或长椭圆形，或多或少侧扁。口小或中型，端位，可伸缩，唇上有肉。颌齿为一或二列之圆锥齿，各齿不愈合或基部愈合，前端多为犬齿，有时突出于嘴角；锄骨及腭骨皆无齿。喉部具有二列的咽头齿。体被圆鳞，头部除鳃盖骨有时被鳞外皆裸出；侧线连续或中断。背鳍单一，连续且长，具VIII-XXI棘，6-21软条；臀鳍具 II -VI 棘，7-18软条。全世界计68属，大约有453种（Nelson, 2006）。 ",
        "info3": "主要于岸边浅水域活动，但有些可栖息于200公尺或更深的海底。通常以珊瑚礁底为栖地，有些则生活在砂地上，遇有危险时会钻入砂中避祸。属日行性鱼类，夜间在砂地上或潜入砂中睡眠。食性复杂，因具有坚强的咽头齿，大部份以被有硬壳之贝类、甲壳类及海胆等为食，亦有以浮游动物、珊瑚虫或小鱼等为食者，甚至有以清洁行为而取得之寄生性无脊椎动物为食者。隆头鱼为珊瑚礁区最显眼而常见之鱼科，体色复杂而偏绿色调，在台湾俗称为『青衣』。幼鱼体色和成鱼往往不同，甚至雌雄之体色亦有所差异，而此种性别两色的情形会伴随着成长而有性转变发生。通常开始型之雌鱼具较平淡之体色，而经性转变之终端型雄鱼则较鲜艷且复杂。终端型雄鱼(terminalmale)具领域性，领域中包括一只交配之成熟雌鱼及数尾性别不明的小鱼，其生殖行为通常是成对的，但不经性转变之鱼则是整群一起产卵。 ",
        "info4": "脊索动物门",
        "info5": "辐鳍鱼纲",
        "info6": "鲈形目"
    },
    {
        "img": "https://adl.seafishery.com/11.jpg",
		"code": "Fish11",
        "name": "裸颊鲷科",
        "info1": "广泛分布于非洲西岸和印度-西太平洋的热带沿岸。",
        "info2": "体延长而呈长椭圆形，稍侧扁。头中大。吻尖锐。口中大，端位，略可伸缩，唇厚。眼的位置偏头部之后上方。上下颌锥状齿或臼齿，前端或扩大成犬齿或无，犬齿外突出或无；锄骨及腭骨无齿。主上颌骨大都被眶前骨所覆盖。体被中型栉鳞；头顶及颊部均裸出。具鳔。背鳍单一，连续，硬棘部长于软条部，且中间无缺刻，具X棘，9-10软条；臀鳍具III棘，8-10软条；腹鳍胸位，具腋鳞；尾鳍内凹。全世界计5属39种（Nelson, 2006）。 ",
        "info3": "本科鱼类之栖息环境和鲷科相似，但具有更宽广之活动空间范围；珊瑚礁及其外围砂泥地，甚至潮间带或低潮带以内之浅水域，均可发现其踪迹。大部份之龙占属夜行性，但亦有为日行性者。属肉食性，又因具臼齿状牙齿，故以具硬壳之无脊椎动物或鱼类为食。有些龙占具性转变之生态适应，会随成长，由雌鱼变为雄鱼，且成鱼之体色和小鱼往往不同。 ",
        "info4": "脊索动物门",
        "info5": "辐鳍鱼纲",
        "info6": "鲈形目"
    },
    {
        "img": "https://adl.seafishery.com/12.jpg",
		"code": "Fish12",
        "name": "鮨科",
        "info1": "广泛分布于热带至温带海域，少数为淡水种。",
        "info2": "体延长，呈长椭圆形，有些侧扁。口大或中型，平裂或略斜裂；上颌骨露出，副上颌骨有或无；下颌通常长于上颌。上下颌齿绒毛状、或尖细、或混有犬齿。主鳃盖骨通常有三枚平扁的棘或突棘，但上下二枚有时不明显，前鳃盖骨后缘有锯齿或有棘。被栉鳞或圆鳞，有时埋入皮下，不甚明显；侧线单一且完全。背鳍连续或分离，硬棘相当发达，VII-XIII，软条10-27；臀鳍硬棘II或III，或无。脊椎骨24-26。种类繁多，科及亚科间之分类上仍有许多争议，现依Nelson（2006）将全世界鮨科归类为3亚科，粗估约64属，475种以上，分别鮨亚科（Serraninae）约13属75种左右、花鲈亚科（Anthinae）约21属170种左右及石斑鱼亚科（Epinephelinae），石斑鱼亚科又分5族，分别为东洋鲈族（Niphonini）1属1种、石斑鱼族（Epinephelini）约15属100种左右、黄鲈族（Diploprionini）3属5种、长鲈族（Liopropomini）3属及黑鲈族（Grammistini）的8属21种左右。 ",
        "info3": "鮨科大部分为海水产，少数为淡水产。多半属日行性鱼类，由于种数甚多，具相当复杂之生态层性。大多属底栖性之鱼种，且具领域性及拟态行为。绝大多数以鱼类、虾、蟹、端足类等为食，是凶猛的掠食者。而花鲈亚科之拟花鮨属（Pseudanthias）、珠斑脂属（Sacura）具群游性，日间觅食于水层中，以浮游生物为食，夜间则躲藏于珊瑚礁间之洞穴。本科鱼种体色鲜艷多变化，且具有雌雄双色及雌变雄之转变等现象。有些鱼种和鹦哥鱼及隆头鱼等同样具有社会阶层之地位控制现象的生态适应行为。有些为夜行性鱼类，昼间独居于珊瑚礁或岩礁底部之孔穴中，夜间则在外觅食，例如黑鲈属（Grammistes），且当其受惊吓时，体表会分泌大量 之黏液，具有皂泡效果且内含有毒之黑鲈素 (grammistin) ，故不可食用。",
        "info4": "脊索动物门",
        "info5": "辐鳍鱼纲",
        "info6": "鲈形目"
    },
    {
        "img": "https://adl.seafishery.com/13.jpg",
		"code": "Fish13",
        "name": "鲭科",
        "info1": "广泛分布于世界热带及亚热带之各大海洋。",
        "info2": "体延长，或呈纺缍形；尾柄细瘦而强而有力，两侧有2-3个隆起之棱脊。头大，锥形，突出。口大或中大；颌齿强或弱；锄骨、腭骨具齿或无。体被小圆鳞，或部分被鳞，胸部鳞片特大，有时会形成坚硬多胸甲；侧线完全。背鳍两个相距甚远或接近，第一背鳍基底长或短，由硬棘组成，可收纳于沟槽中；第二背鳍前方鳍条高立或略低；背鳍及臀鳍之后均有小离鳍；腹鳍中型，胸位；胸鳍高位，较短；尾鳍深叉或新月形。全世界计2亚科15属51种（Nelson, 2006）。 ",
        "info3": "包括鲭、鲣、鲔及鰆等在内之鲭科鱼种多是世界上重要的高经济价值食用鱼类，是渔民及休闲游钓者之最爱渔获。均属游泳速度快之中至大型鱼种，其中以太平洋黑鲔(Thunnus orientalis)之体型最大，可达3公尺左右，重达450公斤，可活15年以上（但由于过渔的现象，现在已很少有个体可存活那么久）。均属群游性鱼类，且周年洄游于大洋之表层水面，以鱼类、乌贼及甲壳类为生。具有漂浮性之卵及仔稚鱼。",
        "info4": "脊索动物门",
        "info5": "辐鳍鱼纲",
        "info6": "鲈形目"
    },
    {
        "img": "https://adl.seafishery.com/14.jpg",
		"code": "Fish14",
        "name": "鲹科",
        "info1": "广泛分布于世界三大洋，尤其是热带及亚热带海域，有些种类可生活于半淡咸水域，甚至淡水域。台湾各地海域皆可发现其踪迹。",
        "info2": "体延长而侧扁，体形多样式，纺锤形、椭圆形、卵圆形或菱形等。尾柄一般皆细长，有些种类其背、腹侧具凹槽；两侧则具棱脊。一般皆被细小圆鳞，有些种类则退化而埋于皮下或部份区域裸露。侧线完全，前部多少弯曲，有时侧线上全部或部份具棱鳞。脂性眼睑，或发达，或不发达。上下颌一般皆具齿，一列或呈绒毛齿带；锄骨、腭骨及舌面通常有齿带。鳃盖膜分离，不与喉峡部相连。前鳃盖骨，幼鱼时具小刺，成鱼则平滑。鳃耙通常细长，亦有退化呈瘤状者。两个背鳍多少分离，第一背鳍前方常有一平卧倒棘，棘间通常有膜相连，有些种类第一背鳍棘会随成长而渐退化，甚至消失；第二基底长，前方鳍条有时延长如丝状；臀鳍与第二背鳍同形，其前方具二游离之硬棘，有时会埋入皮下；第二背鳍与臀鳍后方有时具1个或多个离鳍。胸鳍宽短或延长呈镰刀状；腹鳍胸位，I+5；尾鳍叉形。全世界计有4亚科32属，大约140种（Nelson, 1994）。",
        "info3": "大部份的鰺科鱼类属于中表层洄游性鱼类，通常结成群沿着岸边在不同深度的水域巡游，部份的鱼种则喜欢栖息于沙岸或珊瑚礁区；某些种类，像浪人鰺（Caranx ignobilis）、六带鰺（Caranx sexfasciatus）等鱼种，其幼鱼经常出现在河口的汽水域；而素有「领航者」之称的黑带鰺（Naucrates ductor）及无齿鰺（Gnathanodon speciosus）的幼鱼则经常伴随在大型鱼，像鲛、魟之类的身旁，一面可保护自己，一面可捡食大鱼吃剩下的碎屑。大部份的种类主要捕食小鱼，亦有捕食软体动物或甲壳类者，或是以浮游无脊椎动物为食，像圆鰺属（ Decapterus）。",
        "info4": "脊索动物门",
        "info5": "辐鳍鱼纲",
        "info6": "鲈形目"
    },
    {
        "img": "https://adl.seafishery.com/15.jpg",
		"code": "Fish15",
        "name": "石首鱼科",
        "info1": "广泛分布于世界三大洋及河口区，南美洲可发现生活于淡水种。",
        "info2": "体呈长椭圆，稍侧扁，尾柄短或中长。吻钝尖或圆突，吻褶发达，分叶或不分叶。口小或中大，下位或端位。颌齿细小，呈绒毛状，上颌外列齿稍扩大，下颌齿皆细小，或上下颌齿皆有扩大的状况，有时前端具犬齿；锄骨及腭骨均无齿。吻部及颏部均具黏液孔。有些种类具颏须。鳔发达，呈圆筒形、锤形或锚形，有时前端两侧向后呈管状延长；两侧常具侧枝多对。体被圆鳞或栉鳞；侧线完全；头部被鳞；背鳍和臀鳍被鳞或无。背鳍连续，硬棘部及软条部间具深或浅缺刻；腹鳍胸位；尾鳍圆形、截形、楔形、叉形或双凹形。全世界计70属的270种（Nelson, 2006）。",
        "info3": "主要栖息于沿海砂泥底质海域及河口区，有些能发现于淡水域，尤其是分布于南美洲的鱼种。因其能借连于鳔上的肌肉产生不同的声响，所以本科鱼在西方被称为鼓鱼「drums」或鸣鱼「croakers」。肉食性，以小鱼、虾、蟹及其它底栖动物为食。",
        "info4": "脊索动物门",
        "info5": "辐鳍鱼纲",
        "info6": "鲈形目"
    },
    {
        "img": "https://adl.seafishery.com/16.jpg",
		"code": "Fish16",
        "name": " 䲗科",
        "info1": "分布于世界各暖水域，尤以印度-太平洋海区最多，少数种可进入河川水域。",
        "info2": "体延长，宽而平扁，向后渐细，略侧扁。头纵扁。口小而吻尖；上颌能伸缩自如。眼高位，左右靠近。前鳃盖有一隐于皮下之强棘，棘之末端有一至数枚钩剌，有时在棘之基部另有一逆钩。体裸露无鳞；具侧线。背鳍分两部分，第一背鳍短，具III—IV硬棘，第二背鳍具6—11软条。腹鳍为I,5，喉位，左右远离，最后之软条在有些鱼种会以宽鳍膜与胸鳍基部相连。全世界计10属，约182种（Nelson, 2006）。 ",
        "info3": "主要为砂地或泥地上生活的鱼种，少数种类则栖息于礁区或珊瑚礁附近之砂地上。平时使用腹鳍游走于砂地上，觅食小型底栖无脊椎动物为生，体色与环境 近似，易为人们所忽略。雄鱼体色较特别，且第一背鳍延长为丝状，极易判别，雌鱼之分类则无法利用体色加以区分。",
        "info4": "脊索动物门",
        "info5": "辐鳍鱼纲",
        "info6": "鲈形目"
    },
    {
        "img": "https://adl.seafishery.com/17.jpg",
		"code": "Fish17",
        "name": "羊鱼科",
        "info1": "广泛分布于世界三大洋。",
        "info2": "体呈纺缍形，稍延长而中等侧扁。头小，背部轮廓呈弧形隆起。口小且可伸缩；上颌稍长于下颌；上下颌具一列或数列之绒毛齿或圆锥齿；锄骨和腭骨均具齿或无。颐部具有一对触须。鳃盖骨完整，后缘有一枚平扁的小弱棘或无。体被大形圆鳞或有细棘之栉鳞；侧线一条且完整，偏向于背缘，其上之感觉管常有分枝。背鳍两个，二者分离甚开，硬棘VI-VIII+I，软条8-9；臀鳍具I-II枚弱棘，软条5-8；腹鳍基部具腋鳞；尾鳍为深叉形。全世界计6属约62种（Nelson, 2006）。 ",
        "info3": "大多为群游性近沿海中下层鱼类，但也有单独活动者，亦有种类可在汽水域生活。敏感的触须能感受在砂泥地里小虾、蟹等底栖无脊椎动物的存在，因此在珊瑚礁或岩礁区之浅水域，三两尾须鲷带头觅食，后跟随着粗皮鲷、蝴蝶鱼、臭都鱼或隆头鱼等鱼类在其后面捡食；推测这是一种节省觅食体力的生态适应。有些属夜行性，白天则群栖在珊瑚礁或岩礁旁；有的则在日间活动。",
        "info4": "脊索动物门",
        "info5": "辐鳍鱼纲",
        "info6": "鲈形目"
    },
    {
        "img": "https://adl.seafishery.com/18.jpg",
		"code": "Fish18",
        "name": "鹦嘴鱼科",
        "info1": "广泛分布于世界各热带及亚热带珊瑚礁浅水域。",
        "info2": "体呈长椭圆形而略侧扁，唯体型及体色有随体长增大而改变之现 象。吻呈圆钝形。口小，端位，不外突也不可伸缩；唇厚。颌齿愈合成上下各二片之鸟嘴状齿板，咽喉部具强硬之咽头齿。体被大型鳞；侧线后部中断或少数连续。背鳍单一，具 IX 硬棘及 10 软条；臀鳍具 III 硬棘及 9软条；尾鳍随体长之增大而由圆形或新月形变为双凹形，上下叶或延长如丝。全世界约有10属88种（Nelson, 2006）。",
        "info3": "主要栖息于岸边珊瑚礁区或岩礁区。日行性，昼间于礁区间穿梭觅食，夜间则躲于礁体或岩块下睡觉，有的会分泌黏液茧将自己包裹起来或封在洞口 ，藉着黏液特殊的味道来防止掠食者如鯙类等的攻击，有的甚至会钻入砂中避敌。鹦哥鱼游水的方式不是利用尾鳍来当推进器，而是利用胸鳍的摆动来前进，前进的路线也不是直线，而是上下起伏的波浪状，宛如鸟类的滑翔方式，半划水半滑翔的前进。杂食性，以珊瑚之共生藻及藏在枝芽间之小型无脊椎动物为食，而其磨碎珊瑚后之排泄物含砂量高，即是珊瑚礁区细砂沈积的重要来源。幼鱼是目前生物界已知极少数因为社会行为而变色的例子，就像小学生穿制服上学般，只要群游在一起，不论同种否，一律少数服从多数，体色一致呈现灰褐色或是具纵纹，万一落单了，即刻换装成美丽鲜艳的便服，以融入周遭环境，而这些所有的变色都是瞬间完成，这种的行为模式称之为「群居掩蔽」(grouping crypsis)。大多数鹦哥鱼在成长过程中都会经历雌变雄的性别转变，而体色也伴随着变化：稚鱼期时，成群活动的种类，体色大多为灰褐色，单独活动的种类，则体色艳丽；成长后的鱼在性别转变之前(大多为雌鱼，少数为未经性转变的成熟雄鱼），称之「初期型鱼相(IP, Initial phase)」，体色大多为灰褐色、红色等；到一定体型而产生性转变以后(雌性变雄性），称之「终期型鱼相或次级雄鱼(TP, Terminal phase)」，此时的次级雄鱼色彩鲜丽，以青色和绿色为主，因体色偏绿色调，通常被俗称为青衣或绿仔。",
        "info4": "脊索动物门",
        "info5": "辐鳍鱼纲",
        "info6": "鲈形目"
    },
    {
        "img": "https://adl.seafishery.com/19.jpg",
		"code": "Fish19",
        "name": "鮋科",
        "info1": "广泛分布于全世界热带至温度海域，极少数为淡水种。",
        "info2": "体延长，略侧扁。头大，有棘突或棘棱。口大，齿锐利。眼中大至大。体被小型或中型栉鳞或圆鳞；侧线一条且完整。背鳍一个，连续，硬棘及软条间具缺刻，一般具XI—XVII强壮之硬棘及 8—18软条；臀鳍具I-III硬棘，3-9软条；胸鳍发达，有些种胸鳍下方具游离鳍；各鳍之硬棘基部均有毒腺。全世界共分8亚科：包括平鮋亚科(Sebastinae)有 7属133种左右、囊头鮋亚科 (Setarchinae)有 3属5种、新平鮋亚科(Neosebastinae)2属17种、鮋亚科 (Scorpaeninae)有 20属185种以上、须簑鮋亚科(Apistinae)有 3属3种、长绒鮋亚科(Tetraroginae)有 11属38种左右、毒鮋亚科 (Synanceiinae)有 9属35种、平额鮋亚科(Plectrogeninae)衹有 1属2种，共计约56属418种以上（Nelson, 2006）。 ",
        "info3": "近沿岸的肉食性鱼种，喜栖息于岩礁底层之间，极少数种生活在深海中。大多游动缓慢，但可短距离快速移动捕食。体色多变化，常与四周环境形成拟态，它们最常拟态为石头，以守株待兔的方法来捕食其他鱼类。例如在珊瑚礁区较常见的狮子鱼(lionfish) 和石狗公 (scorpionfish) 。前者会以腹面朝壁，背面朝外的自卫方式以停栖在礁壁之上，但偶而也会到水层中游动；后者则多半停栖在礁石上且与四周环境完全相拟态，来自卫及营生。它们有的具领域性，尤其当生殖季节更加明显。",
        "info4": "脊索动物门",
        "info5": "辐鳍鱼纲",
        "info6": "鲉形目"
    },
    {
        "img": "https://adl.seafishery.com/20.jpg",
		"code": "Fish20",
        "name": "鲻科",
        "info1": "广泛分布于所有热带与温带海域。",
        "info2": "体延长，微侧扁，略呈圆柱体形。头中大，常宽而平扁。口小，端位或近下位。前颌骨能伸出；颌齿细小或无齿。鳞中大，头部被圆鳞，体被弱栉鳞，鳍上亦常被小圆鳞；头部及体侧的侧线发达。鳃耙细长，形成滤过器，可滤取泥砂中之有机物，且具有强韧之胃，有助于磨碎食物。具二个相当分离的背鳍，第一背鳍具IV硬棘，第二背鳍具I硬棘，7-10软条；臀鳍具III硬棘，8-10软条；胸鳍具腋鳞或无；腹鳍腋鳞发达；尾鳍内凹或稍分叉形。全世界约17属，约72种（Nelson, 2006）。",
        "info3": "栖息范围广，通常于沿近海域，但经常进入河口区及淡水域。大多为群游性，会数百尾成群一起洄游。杂食性，一般以有机碎屑及藻类为食，有些则为纯藻食性，甚至有的可食水生昆虫、鱼卵及浮游生物等。",
        "info4": "脊索动物门",
        "info5": "辐鳍鱼纲",
        "info6": "鲻形目"
    }
]

module.exports = {
    data
}
